#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-3GWYCdepnNVoSzEF

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.quarkus_hibernate_search_extras["yrodiere"] will be created
  + resource "github_repository_collaborator" "quarkus_hibernate_search_extras" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "quarkus-hibernate-search-extras"
      + username                    = "yrodiere"
    }

  # github_team_membership.quarkus_hibernate_search_extras["marko-bekhta"] will be created
  + resource "github_team_membership" "quarkus_hibernate_search_extras" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "5449102"
      + username = "marko-bekhta"
    }

  # github_team_membership.quarkus_hibernate_search_extras["yrodiere"] will be destroyed
  # (because key ["yrodiere"] is not in for_each map)
  - resource "github_team_membership" "quarkus_hibernate_search_extras" {
      - etag     = "W/"e5f17b9394afb6bd0e99993f7550d3690f142cbba2a39102f64a185b25f898ab"" -> null
      - id       = "5449102:yrodiere" -> null
      - role     = "maintainer" -> null
      - team_id  = "5449102" -> null
      - username = "yrodiere" -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*